In [1]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df = df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'], axis='columns')
df.head()

   Pclass     Sex   Age     Fare  Survived
0       3    male  22.0   7.2500         0
1       1  female  38.0  71.2833         1
2       3  female  26.0   7.9250         1
3       1  female  35.0  53.1000         1
4       3    male  35.0   8.0500         0

In [4]:
target = df.Survived
inputs = df.drop('Survived', axis='columns')

In [6]:
dummies = pd.get_dummies(inputs.Sex, dtype=int)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [7]:
inputs = pd.concat([inputs, dummies], axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [8]:
inputs = inputs.drop('Sex', axis='columns')
inputs.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [10]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [11]:
inputs.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [12]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head(6)

   Pclass        Age     Fare  female  male
0       3  22.000000   7.2500       0     1
1       1  38.000000  71.2833       1     0
2       3  26.000000   7.9250       1     0
3       1  35.000000  53.1000       1     0
4       3  35.000000   8.0500       0     1
5       3  29.699118   8.4583       0     1

In [16]:
from sklearn.model_selection import train_test_split
x_train,x_test,y_train,y_test=train_test_split(inputs, target, test_size=0.2)

In [17]:
len(x_train)

712

In [18]:
len(x_test)

179

In [19]:
len(inputs)

891

In [21]:
from sklearn.naive_bayes import GaussianNB

In [22]:
model = GaussianNB()
model.fit(x_train, y_train)

GaussianNB()

In [23]:
model.score(x_test, y_test)

0.7821229050279329

In [24]:
x_test[:10]

     Pclass        Age     Fare  female  male
881       3  33.000000   7.8958       0     1
314       2  43.000000  26.2500       0     1
364       3  29.699118  15.5000       0     1
283       3  19.000000   8.0500       0     1
673       2  31.000000  13.0000       0     1
610       3  39.000000  31.2750       1     0
227       3  20.500000   7.2500       0     1
794       3  25.000000   7.8958       0     1
408       3  21.000000   7.7750       0     1
640       3  20.000000   7.8542       0     1

In [25]:
y_test[:10]

881    0
314    0
364    0
283    1
673    1
610    0
227    0
794    0
408    0
640    0
Name: Survived, dtype: int64

In [26]:
model.predict(x_test[:10])

array([0, 0, 0, 0, 0, 1, 0, 0, 0, 0], dtype=int64)

In [27]:
model.predict_proba(x_test[:10])

array([[0.99109485, 0.00890515],
       [0.97998483, 0.02001517],
       [0.99109331, 0.00890669],
       [0.98913046, 0.01086954],
       [0.98025156, 0.01974844],
       [0.06656553, 0.93343447],
       [0.9893906 , 0.0106094 ],
       [0.99024588, 0.00975412],
       [0.98953848, 0.01046152],
       [0.98933688, 0.01066312]])